//                                                     HW1!!!!!

// Задание 1
// Создайте переменную a. Запишите в нее значение 10, выведите его на экран с помощью метода 
// alert(). Затем запишите в нее значение 20, выведите его на экран.

// let product = 10;
// console.log(product);
// product = 20;
// alert(product);


// Задание 2
// Создайте переменную и присвойте ей значение года выпуска первого iPhone. Выведите значение переменной на экран.

// let firstIphone = 2007;
// alert(firstIphone);

// Задание 3
// Создайте переменную и присвойте ей значение имени создателя языка JavaScript. Выведите значение переменной на экран.

// let creatorJs = String("Brendan Eich");
// alert(creatorJs);

// Задание 4 
// Создайте две переменные 10 и 2. С помощью метода alert() выведите на экран их сумму, разность, произведение и частное (результат деления).

// let a = 10;
// let b = 2;
// let c = a + b;
// alert(c);
// let d = a - b;
// alert(d);
// let e = a * b;
// alert(e);
// let g = a / b;
// alert(g);

// Задание 5
// Возведите 2 в 5-ю степень. Результат запишите в переменную resultи выведите на экран с помощью метода alert()

// let five = Math.pow(2, 5);
// alert(five);

//Задание 6
// Даны переменные: a = 9 и b = 2. Найдите остаток от деления aна bи выведите результат на экран с помощью метода alert()

// let a = 9;
// let b = 2;
// let c = a % b;
// alert(c);

// Задание 7
// Перепишите код с использованием операторов присваивания и инкремента/декремента (количество строк должно остаться прежним):

 //let num = 1;
 // num = num + 5;
// num = num - 3;
// num = num * 7;
// num = num / 3;
// num = num + 1;
// num = num - 1;
//  alert(num);

//num += 5
//alert(num);
//num -= 3;
//num *= 7;
//num /= 3;
//num ++;
//num --;
//alert(num);

// Задание 8
// Создайте переменную age, присвойте значение с помощью метода prompt() "Сколько вам лет?". Результат вывести с помощью alert().

// let age = prompt("Сколько вам лет?");
// alert(age);


//  Задание 9.0
//  Создайте объект user, у которого есть следующие свойства: name, age, isAdmin. 
//  Значения для свойств придумайте произвольные. Обратите внимание, что для свойства name значение должно быть строковым, для age– числовым, а для isAdmin – булевым.

//  const user = {
//      name: String("Vadim"),
//      age: Number(7),
//      isAdmin: Boolean(1),  
//  }
//  console.log(user);

//  Задание 9.1
//  Добавьте объекту user свойство city of residence. Обратите внимание на то, 
//  как правильно добавлять такие методы: через точку или с помощью квадратных скобок.

//  user.cityOfResidence = true;
//  console.log(user);

//  Задание 9.2
//  Измените у объекта 
//  user свойство age на любое другое новое значение.

// user.age = 8;
// console.log(user);

//  Задание 9.3
//  Удалите у объекта user свойство "city of residence".

// delete user.cityOfResidence;
// console.log(user);




//  Задание 9.4               
//  Создайте переменную info, присвойте ей значение с помощью метода 
//  prompt() "Какую информацию хотите узнать о пользователе?".

// let info = prompt("Какую информацию хотите узнать о пользователе?"); //  ????????????????????????
//////                                ????????????????????????????????????
//////                                ????????????????????????????????????
//  Далее обращайтесь к свойствам объекта  ????????????????????????????????????
//  user через переменную  info. Выведите результат с помощью alert. ????????????????????????????????????

// Задание 10
// С помощью метода prompt()спросите у пользователя его имя и сохраните в переменную.
// С помощью метода alert()выведите на экран шаблонную строку: Привет, ИМЯ!

// let age = prompt('Сколько тебе лет?');
// alert(`Тебе ${age} лет!`); 
